app/controllers/service/messages_controller.rb

	def send_message

		if authenticate

			@message=Message.create(message_params)
---
INSERT INTO "messages" ("user_id", "category", "description", "media", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"