app/controllers/service/sessions_controller.rb

	def create
		puts "***************|Login|*******************"
	    @user = User.find_by_email(params[:user][:email])
	    if @user.present? && @user.valid_password?(params[:user][:password])
	      puts "***************|user presente|*******************"
	      @user.update_column(:authentication_token, User.generate_authentication_token)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "junior@gmail.com"]]
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_sign_in_at", "2016-08-05 03:14:55.266895"], ["current_sign_in_at", "2016-08-05 03:16:37.169224"], ["sign_in_count", 3], ["updated_at", "2016-08-05 03:16:37.170846"], ["id", 1]]