app/controllers/service/users_controller.rb

	def create
		@user=User.create(users_params)
---
INSERT INTO "users" ("name", "email", "contact", "encrypted_password", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"